# St7GetHRAMode

Returns the harmonic mode for harmonic response analysis.

long St7GetHRAMode(long uID, long* MType)
Input Parameters
uID
Strand7 model file ID.
Output Parameters
MType
Harmonic mode; either hmVsFrequency or hmVsTime.